Revit 2026 API

# RenderingQualitySettingsRenderTime Property

---

The render target time as a numerical value between 1 and 32768.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RenderTime { get; set; }
```
```vb
Public Property RenderTime As Integer
	Get
	Set
```
```cpp
public:
property int RenderTime {
	int get ();
	void set (int value);
}
```
```fsharp
member RenderTime : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value is not valid RenderTime. |
| InvalidOperationException | When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom. |

Increase this value to increase render time.

#### Reference

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace